package problemList.dp.solution;

/**
转化成两个人, 起点都是(0, 0), 终点都是(m - 1, n - 1), 这两个人一共能够摘到的樱桃数量的最大值
对于第一个人的位置(i1, j1), 第二个人的位置(i2, j2), 有如下关系: 
    这里我们规定, 两个人同时移动, 那么对于某一个时间, 两人移动的距离都是相等的, 也就是i1 + j1 == i2 + j2
    也就是说, 我们可以将i1, j1, i2, j2四个变量描述的状态简化成三个变量来描述: i1, i2, k, 其中, k == i1 + j1 == i2 + j2, 即移动的步数
        对于k, 也有另一种理解方式: 因为这里i1 + j1 == i2 + j2, 因此其实这两个人在任一时刻, 都会处在同一条对角线(右上到左下)上
        如果规定(0, 0)是第0条对角线, 那么这里就是第k条对角线
    在(i1, i2, k)的状态表示下, j1, j2的计算方式如下: 
        j1 = k - i1, j2 = k - i2;
因此给出状态定义: dp[i1][i2][k] 表示从(i1, j1), (i2, j2)到(m - 1, n - 1)最多能够得到多少樱桃, 其中k = i1 + j1 = i2 + j2
    (i1, j1), (i2, j2)依赖四个状态: (i1 + 1, j1)(i2 + 1, j2), (i1, j1 + 1)(i2 + 1, j2), (i1 + 1, j1)(i2, j2 + 1), (i1, j1 + 1)(i2, j2 + 1)
    使用(i1, i2, k)表示: (i1 + 1, i2 + 1, k + 1), (i1, i2 + 1, k + 1), (i1 + 1, i2, k + 1), (i1, i2, k + 1)
    因此dp[i1][i2][k] = Math.max(Math.max(dp[i1 + 1][i2 + 1][k + 1], dp[i1][i2 + 1][k + 1]), Math.max(dp[i1 + 1][i2][k + 1], dp[i1][i2][k + 1])) + (i1 == i2 ? grid[i1][j2] : grid[i1][j1] + grid[i2][j2]);
初始化: 
    先考虑在原始状态(i1, j1)(i2, j2)情况下如何初始化: 
        这里由于是两个人的状态(i1, j1)(i2, j2), 因此可以当成两个dp表来看, 对于这两个dp表, 其初始化方式都是在最下面添加一行, 最右边添加一列辅助节点
        这些辅助节点的值首先都初始化成-INF(因为这些位置都不能走到, 那么显然应该初始化成非法值), 然后为了保证填表的正确性, 还需要初始化(m, n - 1)(m, n - 1)这个位置或者(m - 1, n)(m - 1, n)这个位置为0
    对应到(i1, i2, k)的情况下: 
        对于这三个维度, 都需要添加辅助节点, 并且是在最后添加, 辅助节点的值同样是-INF
        然后还需要手动初始化(m, m, m + n - 1)这个位置为0
        * 为了初始化的方便, 这里也可以首先把所有的dp值都初始化成-INF, 然后再手动初始化dp[m][m][m + n - 1] = 0;即可
        * 但是代码中我用的是更复杂的初始化方式, 即手动初始化三个面的dp值为-INF
-1的处理: 
    为了处理 "不可达" 的情况, 我们可以首先将所有dp值都填为-INF, 这样就能够保证正确更新 "不可达" 的信息
结合上面的分析, 初始化方式还是选用 "全部初始化为-INF, 再将其中一个位置置0" 这种方式更方便
return dp[0][0][0];

* 或许你可能认为, 只要我正确做了所有辅助节点的初始化, 那么其余节点, 不初始化成-INF也没事
    但是实际不是这样的, 因为除了节点值为-1的这种 "不可达" 节点, 其实还有k不符合要求的 "不可达" 节点, 那么这些节点我们也应该初始化为-INF
    否则在后续的计算中, 还是会认为这些 实际上已经不可达的点 为合法的点, 从而计算出错误结果
 */
public class LC741 {
    public int cherryPickup(int[][] grid) {
        int m = grid.length, n = grid[0].length, INF = 0x3f3f3f3f;
        int[][][] dp = new int[m + 1][m + 1][m + n];
        for(int i2 = 0;i2 <= m;i2++){
            for(int k = 0;k < m + n;k++) dp[m][i2][k] = -INF;
        }
        for(int i1 = 0;i1 <= m;i1++){
            for(int k = 0;k < m + n;k++) dp[i1][m][k] = -INF;
        }
        for(int i1 = 0;i1 <= m;i1++){
            for(int i2 = 0;i2 <= m;i2++) dp[i1][i2][m + n - 1] = -INF;
        }
        // dp[m][m][m + n - 1] = 0;
        dp[m - 1][m - 1][m + n - 1] = 0;
        for(int i1 = m - 1;i1 >= 0;i1--){
            for(int i2 = m - 1;i2 >= 0;i2--){
                for(int k = m + n - 2;k >= 0;k--){
                    dp[i1][i2][k] = -INF;
                    int j1 = k - i1, j2 = k - i2;
                    if(j1 < 0 || j2 < 0 || j1 >= n || j2 >= n) continue;
                    if(grid[i1][j1] == -1 || grid[i2][j2] == -1) continue;
                    dp[i1][i2][k] = Math.max(Math.max(dp[i1 + 1][i2 + 1][k + 1], dp[i1][i2 + 1][k + 1]), 
                        Math.max(dp[i1 + 1][i2][k + 1], dp[i1][i2][k + 1])) + (i1 == i2 ? grid[i1][j2] : grid[i1][j1] + grid[i2][j2]);
                }
            }
        }
        return Math.max(0, dp[0][0][0]);
    }
}
